Repository: chelly1221/lemonkorean
Catalog: mobile/lemon_*/lib/l10n/app_*.arb
Languages: es, ja, ko, zh_tw

# notificationStudyReminder
source: Don't forget to complete your daily Korean practice~
es: No olvides completar tu práctica diaria de coreano~

# notificationReviewTime
source: Time to review!
es: ¡Hora de repasar!

# notificationReviewReminder
source: Let's review what you've learned before~
es: Repasemos lo que has aprendido antes~

# notificationReviewLesson
source: Time to review "{lessonTitle}"~
es: ¡Es hora de repasar "{lessonTitle}"~

source: Keep going!
es: ¡Sigue adelante!

# scoreDisplay
source: Score: {correct} / {total}
es: Puntuación: {correct} / {total}

# loadDataError
source: Failed to load data: {error}
es: Error al cargar datos: {error}

# downloadError
source: Download error: {error}
es: Error de descarga: {error}

# deleteError
source: Delete failed: {error}
es: Error al eliminar: {error}

# clearAllError
source: Clear all failed: {error}
es: Error al borrar todo: {error}

# cleanupError
source: Cleanup failed: {error}
es: Error de limpieza: {error}

# downloadLessonFailed
source: Download failed: {title}
es: Descarga fallida: {title}

source: Comprehensive
es: Integral

# answeredCount
source: Answered {answered}/{total}
es: Respondidas {answered}/{total}

source: Hanja word
es: Palabra Hanja

source: Tap to flip back
es: Toca para voltear

source: Similarity with Chinese
es: Similitud con chino

source: Hanja word, similar pronunciation
es: Palabra Hanja, pronunciación similar

source: Same etymology, easy to remember
es: Misma etimología, fácil de recordar

source: Some connection
es: Alguna conexión

source: Native word, needs memorization
es: Palabra nativa, requiere memorización

source: Rules
es: Reglas

# koreanLanguage
source: 🇰🇷 Korean
es: 🇰🇷 Coreano

# chineseLanguage
source: 🇨🇳 Chinese
es: 🇨🇳 Chino

# exampleNumber
source: Ex. {number}
es: Ej. {number}

# fillInBlankPrompt
source: Fill in blank:
es: Rellenar espacio:

# correctFeedback
source: Excellent! Correct!
es: ¡Excelente! ¡Correcto!

# incorrectFeedback
source: Not quite, try again
es: No del todo, intenta de nuevo

# allStagesPassed
source: All 7 stages passed
es: Las 7 etapas completadas

# continueToLearnMore
source: Continue learning more
es: Continúa aprendiendo más

source: Repeat enabled
es: Repetición activada

source: Repeat disabled
es: Repetición desactivada

source: Stop
es: Detener

source: Playback speed
es: Velocidad de reproducción

# slowSpeed
source: Slow
es: Lenta

source: Mouth shape
es: Forma de la boca

source: Tongue position
es: Posición de la lengua

source: Air flow
es: Flujo de aire

# nativeComparison
source: Native language comparison
es: Comparación con idioma nativo

source: Similar sounds
es: Sonidos similares

source: Sound discrimination
es: Discriminación de sonidos

# listenAndSelect
source: Listen and select the correct character
es: Escucha y selecciona el carácter correcto

source: Similar sound groups
es: Grupos de sonidos similares

# plainSound
source: Plain
es: Sonido simple

# aspiratedSound
source: Aspirated
es: Sonido aspirado

# tenseSound
source: Tense
es: Sonido tenso

source: Writing practice
es: Práctica de escritura

source: Watch animation
es: Ver animación

source: Trace with guide
es: Trazar con guía

source: Freehand writing
es: Escritura libre

# clearCanvas
source: Clear
es: Borrar

source: Show guide
es: Mostrar guía

source: Hide guide
es: Ocultar guía

# writingAccuracy
source: Accuracy
es: Precisión

# tryAgainWriting
source: Try again
es: Intentar de nuevo

source: Next step
es: Siguiente paso

# strokeOrderStep
source: Step {current}/{total}
es: Paso {current}/{total}

source: Syllable combination
es: Combinación de sílabas

source: Select consonant
es: Seleccionar consonante

source: Select vowel
es: Seleccionar vocal

# selectFinalConsonant
source: Select final consonant (optional)
es: Seleccionar consonante final (opcional)

source: No final consonant
es: Sin consonante final

source: Combined syllable
es: Sílaba combinada

source: Play syllable
es: Reproducir sílaba

source: Decompose syllable
es: Descomponer sílaba

source: Batchim practice
es: Práctica de Batchim

source: Batchim explanation
es: Explicación de Batchim

source: Record pronunciation
es: Grabar pronunciación

source: Start recording
es: Iniciar grabación

source: Stop recording
es: Detener grabación

source: Play recording
es: Reproducir grabación

source: Compare with native
es: Comparar con nativo

source: Shadowing mode
es: Modo de seguimiento

source: Listen then repeat
es: Escuchar y repetir

source: Self evaluation
es: Autoevaluación

source: Accurate
es: Preciso

source: Almost correct
es: Casi correcto

source: Needs practice
es: Necesita práctica

# recordingNotSupported
source: Recording is not supported on this platform
es: La grabación no está soportada en esta plataforma

source: Show meaning
es: Mostrar significado

source: Hide meaning
es: Ocultar significado

source: Example word
es: Palabra de ejemplo

# meaningToggle
source: Meaning display setting
es: Configuración de visualización de significado

# microphonePermissionRequired
source: Microphone permission is required for recording
es: Se requiere permiso de micrófono para grabar

source: Activities
es: Actividades

# listeningAndSpeaking
source: Listening & Speaking
es: Escucha y habla

# readingAndWriting
source: Reading & Writing
es: Lectura y escritura

# soundDiscriminationDesc
source: Train your ear to distinguish similar sounds
es: Entrena tu oído para distinguir sonidos similares

# shadowingDesc
source: Listen and repeat after native speakers
es: Escucha y repite con hablantes nativos

# syllableCombinationDesc
source: Learn how consonants and vowels combine
es: Aprende cómo se combinan consonantes y vocales

# batchimPracticeDesc
source: Practice final consonant sounds
es: Practica los sonidos de consonantes finales

# writingPracticeDesc
source: Practice writing Korean characters
es: Practica escribir caracteres coreanos

# webNotSupported
source: Not available on web
es: No disponible en web

# experiencePoints
source: +{points} XP
ja: 経験値 +{points}
ko: 경험치 +{points}
zh_tw: 經驗值 +{points}
