Repository: chelly1221/lemonkorean
Catalog: mobile/lemon_*/lib/l10n/app_*.arb
Languages: es, ja, ko, zh_tw

# appName
source: Lemon Korean
es: Lemon Coreano
ja: レモン韓国語
ko: 레몬 한국어
zh_tw: 檸檬韓語

source: Log In
es: Iniciar sesión
ja: ログイン
ko: 로그인
zh_tw: 登錄

# register
source: Sign Up
es: Registrarse
ja: 新規登録
ko: 회원가입
zh_tw: 註冊

source: Email
es: Correo electrónico
ja: メールアドレス
ko: 이메일
zh_tw: 郵箱

source: Password
es: Contraseña
ja: パスワード
ko: 비밀번호
zh_tw: 密碼

source: Confirm Password
es: Confirmar contraseña
ja: パスワード確認
ko: 비밀번호 확인
zh_tw: 確認密碼

source: Username
es: Nombre de usuario
ja: ユーザー名
ko: 사용자 이름
zh_tw: 用戶名

# enterEmail
source: Enter your email address
es: Ingresa tu correo electrónico
ja: メールアドレスを入力してください
ko: 이메일 주소를 입력하세요
zh_tw: 請輸入郵箱地址

# enterPassword
source: Enter your password
es: Ingresa tu contraseña
ja: パスワードを入力してください
ko: 비밀번호를 입력하세요
zh_tw: 請輸入密碼

# enterConfirmPassword
source: Enter your password again
es: Ingresa tu contraseña nuevamente
ja: パスワードを再入力してください
ko: 비밀번호를 다시 입력하세요
zh_tw: 請再次輸入密碼

# enterUsername
source: Enter your username
es: Ingresa tu nombre de usuario
ja: ユーザー名を入力してください
ko: 사용자 이름을 입력하세요
zh_tw: 請輸入用戶名

source: Create Account
es: Crear cuenta
ja: アカウント作成
ko: 계정 만들기
zh_tw: 創建賬號

# startJourney
source: Start your Korean learning journey
es: Comienza tu viaje de aprendizaje del coreano
ja: 韓国語学習を始めましょう
ko: 한국어 학습 여정을 시작하세요
zh_tw: 開始你的韓語學習之旅

source: Interface Language
es: Idioma de la interfaz
ja: 表示言語
ko: 인터페이스 언어
zh_tw: 界面語言

source: Simplified Chinese
es: Chino simplificado
ja: 中国語（簡体字）
ko: 중국어(간체)
zh_tw: 簡體中文

source: Traditional Chinese
es: Chino tradicional
ja: 中国語（繁体字）
ko: 중국어(번체)
zh_tw: 繁體中文

source: Password Requirements
es: Requisitos de contraseña
ja: パスワード要件
ko: 비밀번호 요구사항
zh_tw: 密碼要求

# minCharacters
source: At least {count} characters
es: Al menos {count} caracteres
ja: {count}文字以上
ko: 최소 {count}자 이상
zh_tw: 至少{count}個字符

# containLettersNumbers
source: Contains letters and numbers
es: Contiene letras y números
ja: 英字と数字を含む
ko: 문자와 숫자를 포함해야 합니다
zh_tw: 包含字母和數字

# haveAccount
source: Already have an account?
es: ¿Ya tienes una cuenta?
ja: すでにアカウントをお持ちですか？
ko: 이미 계정이 있으신가요?
zh_tw: 已有賬號？

# noAccount
source: Don't have an account?
es: ¿No tienes una cuenta?
ja: アカウントをお持ちでないですか？
ko: 계정이 없으신가요?
zh_tw: 沒有賬號？

source: Log in now
es: Inicia sesión ahora
ja: ログインする
ko: 로그인하기
zh_tw: 立即登錄

# registerNow
source: Sign up now
es: Regístrate ahora
ja: 新規登録する
ko: 회원가입하기
zh_tw: 立即註冊

# registerSuccess
source: Registration successful
es: Registro exitoso
ja: 登録完了
ko: 가입 완료
zh_tw: 註冊成功

# registerFailed
source: Registration failed
es: Registro fallido
ja: 登録に失敗しました
ko: 가입 실패
zh_tw: 註冊失敗

# loginSuccess
source: Login successful
es: Inicio de sesión exitoso
ja: ログイン成功
ko: 로그인 성공
zh_tw: 登錄成功

source: Login failed
es: Inicio de sesión fallido
ja: ログインに失敗しました
ko: 로그인 실패
zh_tw: 登錄失敗

# networkError
source: Network connection failed. Please check your network settings.
es: Error de conexión de red. Por favor verifica tu configuración de red.
ja: ネットワーク接続に失敗しました。ネットワーク設定をご確認ください。
ko: 네트워크 연결에 실패했습니다. 네트워크 설정을 확인해 주세요.
zh_tw: 網絡連接失敗，請檢查網絡設置

# invalidCredentials
source: Invalid email or password
es: Correo electrónico o contraseña inválidos
ja: メールアドレスまたはパスワードが正しくありません
ko: 이메일 또는 비밀번호가 올바르지 않습니다
zh_tw: 郵箱或密碼錯誤

# emailAlreadyExists
source: Email is already registered
es: El correo electrónico ya está registrado
ja: このメールアドレスは既に登録されています
ko: 이미 등록된 이메일입니다
zh_tw: 郵箱已被註冊

# requestTimeout
source: Request timed out. Please try again.
es: Tiempo de solicitud agotado. Por favor intenta de nuevo.
ja: リクエストがタイムアウトしました。もう一度お試しください。
ko: 요청 시간이 초과되었습니다. 다시 시도해 주세요.
zh_tw: 請求超時，請重試

# operationFailed
source: Operation failed. Please try again later.
es: Operación fallida. Por favor intenta más tarde.
ja: 操作に失敗しました。しばらくしてからもう一度お試しください。
ko: 작업에 실패했습니다. 잠시 후 다시 시도해 주세요.
zh_tw: 操作失敗，請稍後重試

source: Settings
es: Configuración
ja: 設定
ko: 설정
zh_tw: 設置

source: Language Settings
es: Configuración de idioma
ja: 言語設定
ko: 언어 설정
zh_tw: 語言設置

source: Chinese Display
es: Visualización del chino
ja: 中国語表示
ko: 중국어 표시
zh_tw: 中文顯示

# chineseDisplayDesc
source: Choose how Chinese characters are displayed. Changes will be applied to all screens immediately.
es: Elige cómo se muestran los caracteres chinos. Los cambios se aplicarán a todas las pantallas inmediatamente.
ja: 中国語の表示方法を選択してください。変更後すぐにすべての画面に適用されます。
ko: 중국어 문자 표시 방식을 선택하세요. 변경 시 즉시 모든 화면에 적용됩니다.
zh_tw: 選擇中文文字顯示方式。更改後將立即應用到所有界面。

# switchedToSimplified
source: Switched to Simplified Chinese
es: Cambiado a chino simplificado
ja: 簡体字に切り替えました
ko: 중국어(간체)로 전환되었습니다
zh_tw: 已切換到簡體中文

# switchedToTraditional
source: Switched to Traditional Chinese
es: Cambiado a chino tradicional
ja: 繁体字に切り替えました
ko: 중국어(번체)로 전환되었습니다
zh_tw: 已切換到繁體中文

# displayTip
source: Tip: Lesson content will be displayed using your selected Chinese font.
es: Consejo: El contenido de las lecciones se mostrará usando la fuente china seleccionada.
ja: ヒント：レッスンの内容は選択した中国語フォントで表示されます。
ko: 팁: 강의 내용은 선택한 중국어 글꼴로 표시됩니다.
zh_tw: 提示：課程內容將使用您選擇的中文字體顯示。

source: Notification Settings
es: Configuración de notificaciones
ja: 通知設定
ko: 알림 설정
zh_tw: 通知設置

source: Enable Notifications
es: Habilitar notificaciones
ja: 通知を有効にする
ko: 알림 사용
zh_tw: 啟用通知

# enableNotificationsDesc
source: Turn on to receive learning reminders
es: Activa para recibir recordatorios de aprendizaje
ja: オンにすると学習リマインダーを受け取れます
ko: 켜면 학습 알림을 받을 수 있습니다
zh_tw: 開啟後可以接收學習提醒

# permissionRequired
source: Please allow notification permissions in system settings
es: Por favor permite los permisos de notificación en la configuración del sistema
ja: システム設定で通知の許可を有効にしてください
ko: 시스템 설정에서 알림 권한을 허용해 주세요
zh_tw: 請在系統設置中允許通知權限

source: Daily Learning Reminder
es: Recordatorio diario de aprendizaje
ja: 毎日の学習リマインダー
ko: 일일 학습 알림
zh_tw: 每日學習提醒

source: Daily Reminder
es: Recordatorio diario
ja: 毎日のリマインダー
ko: 일일 알림
zh_tw: 每日提醒

# dailyReminderDesc
source: Receive a reminder at a fixed time every day
es: Recibe un recordatorio a una hora fija cada día
ja: 毎日決まった時間に学習リマインダーを送信します
ko: 매일 정해진 시간에 학습 알림을 보냅니다
zh_tw: 每天固定時間提醒學習

source: Reminder Time
es: Hora del recordatorio
ja: リマインダー時刻
ko: 알림 시간
zh_tw: 提醒時間

# reminderTimeSet
source: Reminder time set to {time}
es: Hora del recordatorio establecida a las {time}
ja: リマインダー時刻を{time}に設定しました
ko: 알림 시간이 {time}으로 설정되었습니다
zh_tw: 提醒時間已設置為 {time}

source: Review Reminder
es: Recordatorio de repaso
ja: 復習リマインダー
ko: 복습 알림
zh_tw: 複習提醒

# reviewReminderDesc
source: Receive reminders based on memory curve
es: Recibe recordatorios basados en la curva de memoria
ja: 記憶曲線に基づいて復習リマインダーを送信します
ko: 기억 곡선에 따라 복습 알림을 보냅니다
zh_tw: 根據記憶曲線提醒複習

# notificationTip
source: Tip:
es: Consejo:
ja: ヒント：
ko: 팁:
zh_tw: 提示：

source: Help Center
es: Centro de ayuda
ja: ヘルプセンター
ko: 도움말
zh_tw: 幫助中心

source: Offline Learning
es: Aprendizaje sin conexión
ja: オフライン学習
ko: 오프라인 학습
zh_tw: 離線學習

# howToDownload
source: How do I download lessons?
es: ¿Cómo descargo las lecciones?
ja: レッスンをダウンロードするには？
ko: 강의를 어떻게 다운로드하나요?
zh_tw: 如何下載課程？

# howToDownloadAnswer
source: In the lesson list, tap the download icon on the right to download a lesson. You can study offline after downloading.
es: En la lista de lecciones, toca el ícono de descarga a la derecha para descargar una lección. Puedes estudiar sin conexión después de descargar.
ja: レッスン一覧で右側のダウンロードアイコンをタップするとレッスンをダウンロードできます。ダウンロード後はオフラインで学習できます。
ko: 강의 목록에서 오른쪽의 다운로드 아이콘을 탭하면 강의를 다운로드할 수 있습니다. 다운로드 후 오프라인으로 학습할 수 있습니다.
zh_tw: 在課程列表中，點擊右側的下載圖標即可下載課程。下載後可以離線學習。

# howToUseDownloaded
source: How do I use downloaded lessons?
es: ¿Cómo uso las lecciones descargadas?
ja: ダウンロードしたレッスンを使うには？
ko: 다운로드한 강의는 어떻게 사용하나요?
zh_tw: 如何使用已下載的課程？

# howToUseDownloadedAnswer
source: You can study downloaded lessons normally even without network connection. Progress is saved locally and automatically synced when you reconnect.
es: Puedes estudiar las lecciones descargadas normalmente incluso sin conexión a la red. El progreso se guarda localmente y se sincroniza automáticamente cuando te reconectes.
ja: ネットワーク接続がなくても、ダウンロードしたレッスンは通常通り学習できます。進捗はローカルに保存され、ネットワーク接続時に自動的に同期されます。
ko: 네트워크에 연결되어 있지 않아도 다운로드한 강의를 정상적으로 학습할 수 있습니다. 진도는 로컬에 저장되며 네트워크 연결 시 자동으로 동기화됩니다.
zh_tw: 即使沒有網絡連接，您也可以正常學習已下載的課程。進度會在本地保存，聯網後自動同步。

source: Storage Management
es: Gestión de almacenamiento
ja: ストレージ管理
ko: 저장 공간 관리
zh_tw: 存儲管理

# howToCheckStorage
source: How do I check storage space?
es: ¿Cómo verifico el espacio de almacenamiento?
ja: ストレージ容量を確認するには？
ko: 저장 공간은 어떻게 확인하나요?
zh_tw: 如何查看存儲空間？

# howToCheckStorageAnswer
source: Go to [Settings → Storage Management] to view used and available storage space.
es: Ve a [Configuración → Gestión de almacenamiento] para ver el espacio utilizado y disponible.
ja: 【設定 → ストレージ管理】で使用中と利用可能なストレージ容量を確認できます。
ko: 【설정 → 저장 공간 관리】에서 사용된 저장 공간과 사용 가능한 공간을 확인할 수 있습니다.
zh_tw: 進入【設置 → 存儲管理】可以查看已使用和可用的存儲空間。

# howToDeleteDownloaded
source: How do I delete downloaded lessons?
es: ¿Cómo elimino las lecciones descargadas?
ja: ダウンロードしたレッスンを削除するには？
ko: 다운로드한 강의는 어떻게 삭제하나요?
zh_tw: 如何刪除已下載的課程？

# howToDeleteDownloadedAnswer
source: In [Storage Management], tap the delete button next to the lesson to delete it.
es: En [Gestión de almacenamiento], toca el botón de eliminar junto a la lección para borrarla.
ja: 【ストレージ管理】でレッスンの横にある削除ボタンをタップすると削除できます。
ko: 【저장 공간 관리】에서 강의 옆의 삭제 버튼을 탭하면 삭제됩니다.
zh_tw: 在【存儲管理】頁面，點擊課程旁邊的刪除按鈕即可刪除。

# notificationSection
source: Notification Settings
es: Configuración de notificaciones
ja: 通知設定
ko: 알림 설정
zh_tw: 通知設置

# howToEnableReminder
source: How do I enable learning reminders?
es: ¿Cómo activo los recordatorios de aprendizaje?
ja: 学習リマインダーを有効にするには？
ko: 학습 알림은 어떻게 켜나요?
zh_tw: 如何開啟學習提醒？

# howToEnableReminderAnswer
source: Go to [Settings → Notification Settings] and turn on [Enable Notifications]. You need to grant notification permissions on first use.
es: Ve a [Configuración → Configuración de notificaciones] y activa [Habilitar notificaciones]. Necesitas otorgar permisos de notificación en el primer uso.
ja: 【設定 → 通知設定】で【通知を有効にする】スイッチをオンにしてください。初回使用時は通知の許可が必要です。
ko: 【설정 → 알림 설정】에서 【알림 사용】 스위치를 켜세요. 처음 사용 시 알림 권한을 허용해야 합니다.
zh_tw: 進入【設置 → 通知設置】，打開【啟用通知】開關。首次使用需要授予通知權限。

# whatIsReviewReminder
source: What is a review reminder?
es: ¿Qué es un recordatorio de repaso?
ja: 復習リマインダーとは？
ko: 복습 알림이란 무엇인가요?
zh_tw: 什麼是複習提醒？

# whatIsReviewReminderAnswer
source: Based on the spaced repetition algorithm (SRS), the app will remind you to review completed lessons at optimal times. Review intervals: 1 day → 3 days → 7 days → 14 days → 30 days.
es: Basado en el algoritmo de repetición espaciada (SRS), la aplicación te recordará repasar las lecciones completadas en momentos óptimos. Intervalos de repaso: 1 día → 3 días → 7 días → 14 días → 30 días.
ja: 間隔反復アルゴリズム（SRS）に基づき、学習したレッスンを最適なタイミングで復習するようリマインドします。復習間隔：1日 → 3日 → 7日 → 14日 → 30日。
ko: 간격 반복 알고리즘(SRS)에 기반하여 학습한 강의를 최적의 시간에 복습하도록 알림을 보냅니다. 복습 간격: 1일 → 3일 → 7일 → 14일 → 30일.
zh_tw: 基於間隔重複算法（SRS），應用會在最佳時間提醒您複習已學課程。複習間隔：1天 → 3天 → 7天 → 14天 → 30天。

# languageSection
source: Language Settings
es: Configuración de idioma
ja: 言語設定
ko: 언어 설정
zh_tw: 語言設置

# howToSwitchChinese
source: How do I switch between Simplified and Traditional Chinese?
es: ¿Cómo cambio entre chino simplificado y tradicional?
ja: 簡体字と繁体字を切り替えるには？
ko: 간체와 번체는 어떻게 전환하나요?
zh_tw: 如何切換簡繁體中文？

# howToSwitchChineseAnswer
source: Go to [Settings → Language Settings] and select [Simplified Chinese] or [Traditional Chinese]. Changes take effect immediately.
es: Ve a [Configuración → Configuración de idioma] y selecciona [Chino simplificado] o [Chino tradicional]. Los cambios se aplican inmediatamente.
ja: 【設定 → 言語設定】で【簡体字】または【繁体字】を選択してください。変更後すぐに反映されます。
ko: 【설정 → 언어 설정】에서 【중국어(간체)】 또는 【중국어(번체)】를 선택하세요. 변경 시 즉시 적용됩니다.
zh_tw: 進入【設置 → 語言設置】，選擇【簡體中文】或【繁體中文】。更改後立即生效。

# faq
source: Frequently Asked Questions
es: Preguntas frecuentes
ja: よくある質問
ko: 자주 묻는 질문
zh_tw: 常見問題

# howToStart
source: How do I start learning?
es: ¿Cómo empiezo a aprender?
ja: 学習を始めるには？
ko: 학습은 어떻게 시작하나요?
zh_tw: 如何開始學習？

# howToStartAnswer
source: On the main screen, select a lesson appropriate for your level and start from Lesson 1. Each lesson consists of 7 stages.
es: En la pantalla principal, selecciona una lección apropiada para tu nivel y comienza desde la Lección 1. Cada lección consta de 7 etapas.
ja: メイン画面で自分のレベルに合ったレッスンを選び、レッスン1から始めてください。各レッスンは7つのステージで構成されています。
ko: 메인 화면에서 본인 수준에 맞는 강의를 선택하고 1과부터 시작하세요. 각 강의는 7단계로 구성되어 있습니다.
zh_tw: 在主頁面選擇適合您水平的課程，從第1課開始。每節課包含7個學習階段。

# progressNotSaved
source: What if my progress isn't saved?
es: ¿Qué pasa si mi progreso no se guarda?
ja: 進捗が保存されない場合は？
ko: 진도가 저장되지 않으면 어떻게 하나요?
zh_tw: 進度沒有保存怎麼辦？

# progressNotSavedAnswer
source: Progress is automatically saved locally. If online, it will automatically sync to the server. Please check your network connection.
es: El progreso se guarda automáticamente de forma local. Si estás en línea, se sincronizará automáticamente con el servidor. Por favor verifica tu conexión de red.
ja: 進捗は自動的にローカルに保存されます。オンライン時にサーバーに自動同期されます。ネットワーク接続をご確認ください。
ko: 진도는 자동으로 로컬에 저장됩니다. 네트워크에 연결되면 서버에 자동으로 동기화됩니다. 네트워크 연결을 확인해 주세요.
zh_tw: 進度會自動保存到本地。如果聯網，會自動同步到服務器。請檢查網絡連接。

source: About App
es: Acerca de la aplicación
ja: アプリについて
ko: 앱 정보
zh_tw: 關於應用

# moreInfo
source: More Information
es: Más información
ja: 詳細情報
ko: 추가 정보
zh_tw: 更多信息

source: Version Info
es: Información de versión
ja: バージョン情報
ko: 버전 정보
zh_tw: 版本信息

source: Developer
es: Desarrollador
ja: 開発者
ko: 개발자
zh_tw: 開發者

# appIntro
source: App Introduction
es: Introducción de la aplicación
ja: アプリ紹介
ko: 앱 소개
zh_tw: 應用介紹

# appIntroContent
source: A Korean learning app designed for Chinese speakers, supporting offline learning, smart review reminders, and more.
es: Una aplicación de aprendizaje de coreano diseñada para hablantes de chino, con soporte para aprendizaje sin conexión, recordatorios inteligentes de repaso y más.
ja: 中国語話者向けに設計された韓国語学習アプリです。オフライン学習、スマート復習リマインダーなどの機能をサポートしています。
ko: 중국어 사용자를 위한 한국어 학습 앱입니다. 오프라인 학습, 스마트 복습 알림 등의 기능을 지원합니다.
zh_tw: 專為中文使用者設計的韓語學習應用，支持離線學習、智能複習提醒等功能。

source: Terms of Service
es: Términos de servicio
ja: 利用規約
ko: 서비스 이용약관
zh_tw: 服務條款

# termsComingSoon
source: Terms of Service page is under development...
es: Página de términos de servicio en desarrollo...
ja: 利用規約ページは準備中です...
ko: 서비스 이용약관 페이지는 준비 중입니다...
zh_tw: 服務條款頁面開發中...

source: Privacy Policy
es: Política de privacidad
ja: プライバシーポリシー
ko: 개인정보 처리방침
zh_tw: 隱私政策

# privacyComingSoon
source: Privacy Policy page is under development...
es: Página de política de privacidad en desarrollo...
ja: プライバシーポリシーページは準備中です...
ko: 개인정보 처리방침 페이지는 준비 중입니다...
zh_tw: 隱私政策頁面開發中...

source: Open Source Licenses
es: Licencias de código abierto
ja: オープンソースライセンス
ko: 오픈소스 라이선스
zh_tw: 開源許可

source: Not Started
es: No iniciado
ja: 未開始
ko: 시작 전
zh_tw: 未開始

source: In Progress
es: En progreso
ja: 学習中
ko: 진행 중
zh_tw: 進行中

source: Completed
es: Completado
ja: 完了
ko: 완료
zh_tw: 已完成

source: Not Passed
es: No aprobado
ja: 不合格
ko: 미통과
zh_tw: 未通過

source: Time to Review
es: Hora de repasar
ja: 復習の時間です
ko: 복습할 시간입니다
zh_tw: 該複習了

source: Today
es: Hoy
ja: 今日
ko: 오늘
zh_tw: 今天

source: Tomorrow
es: Mañana
ja: 明日
ko: 내일
zh_tw: 明天

# daysLater
source: {count} days later
es: En {count} días
ja: {count}日後
ko: {count}일 후
zh_tw: {count}天後

source: Noun
es: Sustantivo
ja: 名詞
ko: 명사
zh_tw: 名詞

source: Verb
es: Verbo
ja: 動詞
ko: 동사
zh_tw: 動詞

source: Adjective
es: Adjetivo
ja: 形容詞
ko: 형용사
zh_tw: 形容詞

source: Adverb
es: Adverbio
ja: 副詞
ko: 부사
zh_tw: 副詞

source: Particle
es: Partícula
ja: 助詞
ko: 조사
zh_tw: 助詞

source: Pronoun
es: Pronombre
ja: 代名詞
ko: 대명사
zh_tw: 代詞

source: High Similarity
es: Alta similitud
ja: 高い類似度
ko: 높은 유사도
zh_tw: 高相似度

source: Medium Similarity
es: Similitud media
ja: 中程度の類似度
ko: 중간 유사도
zh_tw: 中等相似度

source: Low Similarity
es: Baja similitud
ja: 低い類似度
ko: 낮은 유사도
zh_tw: 低相似度

# lessonComplete
source: Lesson complete! Progress saved
es: ¡Lección completada! Progreso guardado
ja: レッスン完了！
ko: 강의 완료!
zh_tw: 課程完成！

source: Learning Complete
es: Aprendizaje completado
ja: 学習完了
ko: 학습 완료
zh_tw: 學習完成

# keepLearning
source: Keep up your learning momentum
es: Mantén tu motivación de aprendizaje
ja: 学習のモチベーションを維持しましょう
ko: 학습 열정을 유지하세요
zh_tw: 繼續保持學習熱情

# streakDays
source: Streak +1 day
es: Racha +1 día
ja: 連続学習 +1日
ko: 연속 학습 +1일
zh_tw: 學習連續天數 +1

# streakDaysCount
source: {days} day streak
es: Racha de {days} días
ja: 連続{days}日学習中
ko: 연속 {days}일 학습 중
zh_tw: 已連續學習 {days} 天

source: Lesson Content
es: Contenido de la lección
ja: このレッスンの学習内容
ko: 이번 강의 학습 내용
zh_tw: 本課學習內容

source: Words
es: Palabras
ja: 単語
ko: 단어
zh_tw: 單詞

source: Grammar Points
es: Puntos de gramática
ja: 文法ポイント
ko: 문법 포인트
zh_tw: 語法點

source: Dialogues
es: Diálogos
ja: 会話
ko: 대화
zh_tw: 對話

source: Grammar Explanation
es: Explicación gramatical
ja: 文法説明
ko: 문법 설명
zh_tw: 語法講解

source: Example Sentences
es: Oraciones de ejemplo
ja: 例文
ko: 예문
zh_tw: 例句

source: Previous
es: Anterior
ja: 前へ
ko: 이전
zh_tw: 上一個

source: Next
es: Siguiente
ja: 次へ
ko: 다음
zh_tw: 下一個

# continueBtn
source: Continue
es: Continuar
ja: 続ける
ko: 계속
zh_tw: 繼續

source: Topic Particle
es: Partícula de tema
ja: 主題助詞
ko: 주제 조사
zh_tw: 主題助詞

source: Honorific Ending
es: Terminación honorífica
ja: 敬語語尾
ko: 존경 어미
zh_tw: 敬語結尾

# questionWord
source: What
es: Qué
ja: 何
ko: 무엇
zh_tw: 什麼

source: Hello
es: Hola
ja: こんにちは
ko: 안녕하세요
zh_tw: 你好

source: Thank you
es: Gracias
ja: ありがとうございます
ko: 감사합니다
zh_tw: 謝謝

source: Goodbye
es: Adiós
ja: さようなら
ko: 안녕히 가세요
zh_tw: 再見

source: Sorry
es: Lo siento
ja: すみません
ko: 죄송합니다
zh_tw: 對不起

# imStudent
source: I am a student
es: Soy estudiante
ja: 私は学生です
ko: 저는 학생입니다
zh_tw: 我是學生

# bookInteresting
source: The book is interesting
es: El libro es interesante
ja: 本が面白いです
ko: 책이 재미있습니다
zh_tw: 書很有趣

# isStudent
source: is a student
es: es estudiante
ja: 学生です
ko: 학생입니다
zh_tw: 是學生

# isTeacher
source: is a teacher
es: es profesor
ja: 先生です
ko: 선생님입니다
zh_tw: 是老師

source: What is this?
es: ¿Qué es esto?
ja: これは何ですか？
ko: 이것은 무엇입니까?
zh_tw: 這是什麼？

# whatDoingPolite
source: What are you doing?
es: ¿Qué estás haciendo?
ja: 何をしていますか？
ko: 뭐 하세요?
zh_tw: 在做什麼？

# listenAndChoose
source: Listen and choose the correct translation
es: Escucha y elige la traducción correcta
ja: 聞いて正しい訳を選んでください
ko: 듣고 올바른 번역을 선택하세요
zh_tw: 聽音頻，選擇正確的翻譯

# fillInBlank
source: Fill in the correct particle
es: Llena con la partícula correcta
ja: 正しい助詞を入れてください
ko: 올바른 조사를 채워 넣으세요
zh_tw: 填入正確的助詞

# chooseTranslation
source: Choose the correct translation
es: Elige la traducción correcta
ja: 正しい訳を選んでください
ko: 올바른 번역을 선택하세요
zh_tw: 選擇正確的翻譯

# arrangeWords
source: Arrange the words in the correct order
es: Ordena las palabras correctamente
ja: 正しい順序に単語を並べてください
ko: 올바른 순서로 단어를 배열하세요
zh_tw: 按正確順序排列單詞

# choosePronunciation
source: Choose the correct pronunciation
es: Elige la pronunciación correcta
ja: 正しい発音を選んでください
ko: 올바른 발음을 선택하세요
zh_tw: 選擇正確的發音

# consonantEnding
source: Which topic particle should be used when a noun ends in a consonant?
es: ¿Qué partícula de tema se debe usar cuando un sustantivo termina en consonante?
ja: 名詞が子音で終わる場合、どの主題助詞を使いますか？
ko: 명사가 자음으로 끝날 때 어떤 주제 조사를 사용해야 할까요?
zh_tw: 當名詞以輔音結尾時，應該使用哪個主題助詞？

# correctSentence
source: Choose the correct sentence
es: Elige la oración correcta
ja: 正しい文を選んでください
ko: 올바른 문장을 선택하세요
zh_tw: 選擇正確的句子

# allCorrect
source: All of the above
es: Todas las anteriores
ja: すべて正解
ko: 모두 맞음
zh_tw: 以上都對

source: How are you?
es: ¿Cómo estás?
ja: お元気ですか？
ko: 잘 지내세요?
zh_tw: 你好嗎？

source: What is your name?
es: ¿Cuál es tu nombre?
ja: お名前は何ですか？
ko: 이름이 뭐예요?
zh_tw: 你叫什麼名字？

source: Who are you?
es: ¿Quién eres?
ja: どなたですか？
ko: 누구세요?
zh_tw: 你是誰？

source: Where are you?
es: ¿Dónde estás?
ja: どこにいますか？
ko: 어디에 계세요?
zh_tw: 你在哪裡？

source: Nice to meet you
es: Mucho gusto
ja: はじめまして
ko: 만나서 반갑습니다
zh_tw: 很高興認識你

# areYouStudent
source: You are a student
es: Eres estudiante
ja: あなたは学生です
ko: 당신은 학생입니다
zh_tw: 你是學生

# areYouStudentQuestion
source: Are you a student?
es: ¿Eres estudiante?
ja: 学生ですか？
ko: 학생이에요?
zh_tw: 你是學生嗎？

# amIStudent
source: Am I a student?
es: ¿Soy estudiante?
ja: 私は学生ですか？
ko: 저 학생이에요?
zh_tw: 我是學生嗎？

source: Listening
es: Escucha
ja: リスニング
ko: 듣기
zh_tw: 聽力

# fillBlank
source: Fill in the blank
es: Llenar el espacio
ja: 穴埋め
ko: 빈칸 채우기
zh_tw: 填空

source: Translation
es: Traducción
ja: 翻訳
ko: 번역
zh_tw: 翻譯

source: Word Order
es: Orden de palabras
ja: 語順
ko: 순서 맞추기
zh_tw: 排序

source: Pronunciation
es: Pronunciación
ja: 発音
ko: 발음
zh_tw: 發音

source: Excellent!
es: ¡Excelente!
ja: 素晴らしい！
ko: 훌륭합니다!
zh_tw: 太棒了！

# correctOrderIs
source: Correct order:
es: Orden correcto:
ja: 正しい順序：
ko: 올바른 순서:
zh_tw: 正確順序是:

# correctAnswerIs
source: Correct answer: {answer}
es: Respuesta correcta: {answer}
ja: 正解：
ko: 정답:
zh_tw: 正確答案是:

source: Previous Question
es: Pregunta anterior
ja: 前の問題
ko: 이전 문제
zh_tw: 上一題

source: Next Question
es: Siguiente pregunta
ja: 次の問題
ko: 다음 문제
zh_tw: 下一題

source: Finish
es: Finalizar
ja: 完了
ko: 완료
zh_tw: 完成

source: Quiz Complete!
es: ¡Cuestionario completado!
ja: クイズ完了！
ko: 퀴즈 완료!
zh_tw: 測驗完成！

source: Great Job!
es: ¡Buen trabajo!
ja: よくできました！
ko: 잘했습니다!
zh_tw: 太棒了！

# keepPracticing
source: Keep it up!
es: ¡Sigue así!
ja: 頑張って！
ko: 계속 화이팅!
zh_tw: 繼續加油！

# score
source: Score: {correct} / {total}
es: Puntuación: {correct} / {total}
ja: スコア：{correct} / {total}
ko: 점수: {correct} / {total}
zh_tw: 得分：{correct} / {total}

# masteredContent
source: You've mastered this lesson's content!
es: ¡Has dominado el contenido de esta lección!
ja: このレッスンの内容をマスターしました！
ko: 이 강의 내용을 잘 익혔습니다!
zh_tw: 你已經很好地掌握了本課內容！

# reviewSuggestion
source: Try reviewing the lesson content before trying again!
es: ¡Intenta revisar el contenido de la lección antes de intentar de nuevo!
ja: レッスン内容を復習してから再挑戦してみましょう！
ko: 강의 내용을 다시 복습한 후 도전해 보세요!
zh_tw: 建議複習一下課程內容，再來挑戰吧！

# timeUsed
source: Time: {time}
es: Tiempo: {time}
ja: 所要時間：{time}
ko: 소요 시간: {time}
zh_tw: 用時: {time}

source: Play Audio
es: Reproducir audio
ja: 音声を再生
ko: 오디오 재생
zh_tw: 播放音頻

# replayAudio
source: Replay
es: Reproducir de nuevo
ja: もう一度再生
ko: 다시 재생
zh_tw: 重新播放

# vowelEnding
source: When ending in a vowel, use:
es: Cuando termina en vocal, usa:
ja: 母音で終わる場合は：
ko: 모음으로 끝날 때 사용:
zh_tw: 以元音結尾，使用

source: Lesson {number}
es: Lección {number}
ja: レッスン{number}
ko: {number}과
zh_tw: 第{number}課

# stageIntro
source: Introduction
es: Introducción
ja: レッスン紹介
ko: 강의 소개
zh_tw: 課程介紹

# stageVocabulary
source: Vocabulary
es: Vocabulario
ja: 語彙学習
ko: 어휘 학습
zh_tw: 詞彙學習

# stageGrammar
source: Grammar
es: Gramática
ja: 文法説明
ko: 문법 설명
zh_tw: 語法講解

# stagePractice
source: Practice
es: Práctica
ja: 練習
ko: 연습
zh_tw: 練習

# stageDialogue
source: Dialogue
es: Diálogo
ja: 会話練習
ko: 대화 연습
zh_tw: 對話練習

# stageQuiz
source: Quiz
es: Cuestionario
ja: クイズ
ko: 퀴즈
zh_tw: 測驗

# stageSummary
source: Summary
es: Resumen
ja: まとめ
ko: 요약
zh_tw: 總結

source: Download Lesson
es: Descargar lección
ja: レッスンをダウンロード
ko: 강의 다운로드
zh_tw: 下載課程

source: Downloading...
es: Descargando...
ja: ダウンロード中...
ko: 다운로드 중...
zh_tw: 下載中...

source: Downloaded
es: Descargado
ja: ダウンロード済み
ko: 다운로드됨
zh_tw: 已下載

source: Download Failed
es: Descarga fallida
ja: ダウンロード失敗
ko: 다운로드 실패
zh_tw: 下載失敗

source: Home
es: Inicio
ja: ホーム
ko: 홈
zh_tw: 首頁

source: Lessons
es: Lecciones
ja: レッスン
ko: 강의
zh_tw: 課程

source: Review
es: Repaso
ja: 復習
ko: 복습
zh_tw: 複習

source: Profile
es: Perfil
ja: マイページ
ko: 내 정보
zh_tw: 我的

source: Continue Learning
es: Continuar aprendiendo
ja: 学習を続ける
ko: 계속 학습
zh_tw: 繼續學習

source: Daily Goal
es: Meta diaria
ja: 毎日の目標
ko: 일일 목표
zh_tw: 每日目標

# lessonsCompleted
source: {count} lessons completed
es: {count} lecciones completadas
ja: {count}レッスン完了
ko: {count}과 완료
zh_tw: 已完成 {count} 課

# minutesLearned
source: {minutes} minutes learned
es: {minutes} minutos aprendidos
ja: {minutes}分学習
ko: {minutes}분 학습
zh_tw: 已學習 {minutes} 分鐘

# welcome
source: Welcome back
es: Bienvenido de nuevo
ja: おかえりなさい
ko: 다시 오신 것을 환영합니다
zh_tw: 歡迎回來

source: Good morning
es: Buenos días
ja: おはようございます
ko: 좋은 아침입니다
zh_tw: 早上好

source: Good afternoon
es: Buenas tardes
ja: こんにちは
ko: 좋은 오후입니다
zh_tw: 下午好
