Repository: chelly1221/lemonkorean
Catalog: mobile/lemon_*/lib/l10n/app_*.arb
Languages: es, ja, ko, zh_tw

source: Good evening
es: Buenas noches
ja: こんばんは
ko: 좋은 저녁입니다
zh_tw: 晚上好

source: Log Out
es: Cerrar sesión
ja: ログアウト
ko: 로그아웃
zh_tw: 退出登錄

# confirmLogout
source: Are you sure you want to log out?
es: ¿Estás seguro de que quieres cerrar sesión?
ja: ログアウトしてもよろしいですか？
ko: 정말 로그아웃하시겠습니까?
zh_tw: 確定要退出登錄嗎？

source: Cancel
es: Cancelar
ja: キャンセル
ko: 취소
zh_tw: 取消

source: Confirm
es: Confirmar
ja: 確認
ko: 확인
zh_tw: 確定

source: Delete
es: Eliminar
ja: 削除
ko: 삭제
zh_tw: 刪除

source: Save
es: Guardar
ja: 保存
ko: 저장
zh_tw: 保存

source: Edit
es: Editar
ja: 編集
ko: 편집
zh_tw: 編輯

source: Close
es: Cerrar
ja: 閉じる
ko: 닫기
zh_tw: 關閉

source: Retry
es: Reintentar
ja: 再試行
ko: 재시도
zh_tw: 重試

source: Loading...
es: Cargando...
ja: 読み込み中...
ko: 로드 중...
zh_tw: 加載中...

# noData
source: No data available
es: Sin datos disponibles
ja: データがありません
ko: 데이터가 없습니다
zh_tw: 暫無數據

# error
source: An error occurred
es: Ocurrió un error
ja: エラーが発生しました
ko: 오류가 발생했습니다
zh_tw: 出錯了

# errorOccurred
source: An error occurred
es: Ocurrió un error

source: Reload
es: Recargar

source: No characters available
es: No hay caracteres disponibles

source: Success
es: Éxito
ja: 成功
ko: 성공
zh_tw: 成功

source: Filter
es: Filtrar
ja: フィルター
ko: 필터
zh_tw: 篩選

source: Review Schedule
es: Calendario de repaso
ja: 復習スケジュール
ko: 복습 계획
zh_tw: 複習計劃

# todayReview
source: Today's Review
es: Repaso de hoy
ja: 今日の復習
ko: 오늘의 복습
zh_tw: 今日複習

source: Start Review
es: Comenzar repaso
ja: 復習を始める
ko: 복습 시작
zh_tw: 開始複習

# learningStats
source: Learning Statistics
es: Estadísticas de aprendizaje
ja: 学習統計
ko: 학습 통계
zh_tw: 學習統計

# completedLessonsCount
source: Completed Lessons
es: Lecciones completadas
ja: 完了したレッスン
ko: 완료한 강의
zh_tw: 已完成課程

source: Study Days
es: Días de estudio
ja: 学習日数
ko: 학습 일수
zh_tw: 學習天數

# masteredWordsCount
source: Mastered Words
es: Palabras dominadas
ja: 習得した単語
ko: 습득 단어
zh_tw: 掌握單詞

source: My Vocabulary Book
es: Mi libro de vocabulario
ja: マイ単語帳
ko: 나의 단어장
zh_tw: 我的單詞本

source: Vocabulary Browser
es: Explorador de vocabulario
ja: 単語ブラウザ
ko: 단어 브라우저
zh_tw: 單詞瀏覽器

source: About
es: Acerca de
ja: 情報
ko: 정보
zh_tw: 關於

source: Premium Member
es: Miembro premium
ja: プレミアム会員
ko: 프리미엄 회원
zh_tw: 高級會員

source: Free User
es: Usuario gratuito
ja: 無料ユーザー
ko: 무료 사용자
zh_tw: 免費用戶

# wordsWaitingReview
source: {count} words waiting for review
es: {count} palabras esperando repaso
ja: {count}個の単語が復習待ち
ko: {count}개 단어 복습 대기 중
zh_tw: {count}個單詞等待複習

source: User
es: Usuario
ja: ユーザー
ko: 사용자
zh_tw: 用戶

# onboardingSkip
source: Skip
es: Saltar

# onboardingLanguagePrompt
source: Choose your preferred language
es: Elige tu idioma preferido

# onboardingNext
source: Next
es: Siguiente

# onboardingWelcome
source: Hi! I'm Lemon from Lemon Korean 🍋 Want to learn Korean together?
es: ¡Hola! Soy Limón de Lemon Korean 🍋 ¿Quieres aprender coreano juntos?

# onboardingLevelQuestion
source: What's your current Korean level?
es: ¿Cuál es tu nivel actual de coreano?

# onboardingStart
source: Get Started
es: Comenzar

# onboardingStartWithoutLevel
source: Skip and Get Started
es: Saltar y Comenzar

# levelBeginner
source: Beginner
es: Principiante

# levelBeginnerDesc
source: Let's start from Hangul!
es: ¡No te preocupes! Empecemos desde Hangul

# levelElementary
source: Elementary
es: Elemental

# levelElementaryDesc
source: Practice basic conversations!
es: ¡Practiquemos conversaciones básicas!

# levelIntermediate
source: Intermediate
es: Intermedio

# levelIntermediateDesc
source: Let's speak more naturally!
es: ¡Hablemos más naturalmente!

# levelAdvanced
source: Advanced
es: Avanzado

# levelAdvancedDesc
source: Master detailed expressions!
es: ¡Dominemos expresiones detalladas!

# onboardingWelcomeTitle
source: Welcome to Lemon Korean!
es: ¡Bienvenido a Lemon Coreano!

# onboardingWelcomeSubtitle
source: Your journey to fluency starts here
es: Tu camino hacia la fluidez comienza aquí

# onboardingFeature1Title
source: Learn Offline Anytime
es: Aprende sin conexión en cualquier momento

# onboardingFeature1Desc
source: Download lessons and study without internet
es: Descarga lecciones y estudia sin internet

# onboardingFeature2Title
source: Smart Review System
es: Sistema de repaso inteligente

# onboardingFeature2Desc
source: AI-powered spaced repetition for better retention
es: Repetición espaciada con IA para mejor retención

# onboardingFeature3Title
source: 7-Stage Learning Path
es: Camino de aprendizaje de 7 etapas

# onboardingFeature3Desc
source: Structured curriculum from beginner to advanced
es: Currículum estructurado de principiante a avanzado

# onboardingLevelTitle
source: What's your Korean level?
es: ¿Cuál es tu nivel de coreano?

# onboardingLevelSubtitle
source: We'll personalize your experience
es: Personalizaremos tu experiencia

# onboardingGoalTitle
source: Set your weekly goal
es: Establece tu meta semanal

# onboardingGoalSubtitle
source: How much time can you dedicate?
es: ¿Cuánto tiempo puedes dedicar?

# goalCasualDesc
source: 1-2 lessons per week
es: 1-2 lecciones por semana

# goalCasualTime
source: ~10-20 min/week
es: ~10-20 min/semana

# goalCasualHelper
source: Perfect for busy schedules
es: Perfecto para horarios ocupados

# goalRegularDesc
source: 3-4 lessons per week
es: 3-4 lecciones por semana

# goalRegularTime
source: ~30-40 min/week
es: ~30-40 min/semana

# goalRegularHelper
source: Steady progress without pressure
es: Progreso constante sin presión

# goalSerious
source: Serious
es: Serio

# goalSeriousDesc
source: 5-6 lessons per week
es: 5-6 lecciones por semana

# goalSeriousTime
source: ~50-60 min/week
es: ~50-60 min/semana

# goalSeriousHelper
source: Committed to fast improvement
es: Comprometido con mejora rápida

# goalIntensive
source: Intensive
es: Intensivo

# goalIntensiveDesc
source: Daily practice
es: Práctica diaria

# goalIntensiveTime
source: 60+ min/week
es: 60+ min/semana

# goalIntensiveHelper
source: Maximum learning speed
es: Velocidad máxima de aprendizaje

# onboardingCompleteTitle
source: You're all set!
es: ¡Todo listo!

# onboardingCompleteSubtitle
source: Let's start your learning journey
es: Comencemos tu viaje de aprendizaje

# onboardingSummaryLanguage
source: Interface Language
es: Idioma de interfaz

# onboardingSummaryLevel
source: Korean Level
es: Nivel de coreano

# onboardingSummaryGoal
source: Weekly Goal
es: Meta semanal

# onboardingStartLearning
source: Start Learning
es: Comenzar a aprender

# onboardingBack
source: Back
es: Atrás

# onboardingAccountTitle
source: Ready to start?
es: ¿Listo para empezar?

# onboardingAccountSubtitle
source: Log in or create an account to save your progress
es: Inicia sesión o crea una cuenta para guardar tu progreso

source: App Language
es: Idioma de la aplicación

# appLanguageDesc
source: Select the language for the app interface.
es: Selecciona el idioma para la interfaz de la aplicación.

source: {language} selected
es: {language} seleccionado

source: Sort
es: Ordenar

# notificationTipContent
source: • Review reminders are automatically scheduled after completing a lesson • Some devices may need to disable battery saver in system settings to receive notifications properly
es: • Los recordatorios de repaso se programan automáticamente después de completar una lección • Algunos dispositivos pueden necesitar desactivar el ahorro de batería en la configuración del sistema para recibir notificaciones correctamente

source: Yesterday
es: Ayer

# daysAgo
source: {count} days ago
es: Hace {count} días

# dateFormat
source: {month}/{day}
es: {day}/{month}

source: Download Manager
es: Gestor de descargas

source: Storage Info
es: Información de almacenamiento

# clearAllDownloads
source: Clear All
es: Borrar todo

# downloadedTab
source: Downloaded
es: Descargado

# availableTab
source: Available
es: Disponible

source: Downloaded Lessons
es: Lecciones descargadas

source: Media Files
es: Archivos multimedia

# usedStorage
source: In Use
es: En uso

# cacheStorage
source: Cache
es: Caché

source: All downloads cleared
es: Todas las descargas eliminadas

# availableStorage
source: Available
es: Disponible

source: No downloaded lessons
es: No hay lecciones descargadas

# goToAvailableTab
source: Go to "Available" tab to download lessons
es: Ve a la pestaña "Disponible" para descargar lecciones

source: All lessons downloaded
es: Todas las lecciones descargadas

source: Delete Download
es: Eliminar descarga

# confirmDeleteDownload
source: Are you sure you want to delete "{title}"?
es: ¿Seguro que quieres eliminar "{title}"?

# confirmClearAllDownloads
source: Are you sure you want to delete all {count} downloads?
es: ¿Seguro que quieres eliminar las {count} descargas?

source: Downloading ({count})
es: Descargando ({count})

source: Preparing...
es: Preparando...

source: Lesson {id}
es: Lección {id}

source: Search words...
es: Buscar palabras...

# wordCount
source: {count} words
es: {count} palabras

# sortByLesson
source: By Lesson
es: Por lección

# sortByKorean
source: By Korean
es: Por coreano

# sortByChinese
source: By Chinese
es: Por chino

source: No words found
es: No se encontraron palabras

# noMasteredWords
source: No mastered words yet
es: Aún no hay palabras dominadas

# exampleSentence
source: Example
es: Ejemplo

source: Mastered
es: Dominado

source: Completed Lessons
es: Lecciones completadas

source: No completed lessons
es: No hay lecciones completadas

# startFirstLesson
source: Start your first lesson!
es: ¡Comienza tu primera lección!

source: Mastered Words
es: Palabras dominadas

source: Download
es: Descargar

# hangulLearning
source: Korean Alphabet
es: Alfabeto Coreano

# hangulLearningSubtitle
source: Learn 40 Korean alphabet letters
es: Aprende 40 letras del alfabeto coreano

source: Edit Notes
es: Editar notas

source: Notes
es: Notas

# notesHint
source: Why are you bookmarking this word?
es: ¿Por qué guardas esta palabra?

source: Sort by
es: Ordenar por

# sortNewest
source: Newest first
es: Más reciente

# sortOldest
source: Oldest first
es: Más antiguo

# sortKorean
source: Korean
es: Por coreano

# sortChinese
source: Chinese
es: Por chino

# sortMastery
source: Mastery level
es: Por dominio

# filterAll
source: All
es: Todos

# filterNew
source: New (Level 0)
es: Nuevas (nivel 0)

# filterBeginner
source: Beginner (Level 1)
es: Principiante (nivel 1)

# filterIntermediate
source: Intermediate (Level 2-3)
es: Intermedio (nivel 2-3)

# filterAdvanced
source: Advanced (Level 4-5)
es: Avanzado (nivel 4-5)

# searchWordsNotesChinese
source: Search words, Chinese, or notes...
es: Buscar palabras, chino o notas...

source: Start Review ({count})
es: Comenzar repaso ({count})

source: Remove
es: Eliminar

source: Confirm Remove
es: Confirmar eliminación

# confirmRemoveWord
source: Remove "{word}" from vocabulary book?
es: ¿Eliminar「{word}」del libro de vocabulario?

# noBookmarkedWords
source: No bookmarked words yet
es: No hay palabras guardadas

# bookmarkHint
source: Tap the bookmark icon on word cards while learning
es: Toca el ícono de marcador en las tarjetas de palabras durante el estudio

# noMatchingWords
source: No matching words found
es: No hay palabras coincidentes

# weeksAgo
source: {count} weeks ago
es: Hace {count} semanas

source: Review Complete!
es: ¡Repaso completado!

# reviewCompleteCount
source: Reviewed {count} words
es: {count} palabras repasadas

source: Correct
es: Correcto

source: Wrong
es: Incorrecto

source: Accuracy
es: Precisión

source: Vocabulary Book Review
es: Repaso del vocabulario

source: No words to review
es: No hay palabras para repasar

# bookmarkWordsToReview
source: Bookmark words during learning to start reviewing
es: Guarda palabras para comenzar a repasar

source: Return to Vocabulary Book
es: Volver al vocabulario

source: Exit
es: Salir

source: Show Answer
es: Mostrar respuesta

source: Did you remember?
es: ¿La recordaste?

source: Forgot
es: Olvidé

source: Hard
es: Difícil

source: Remembered
es: Recordé

source: Easy
es: Fácil

source: Added to vocabulary book
es: Agregado al vocabulario

# addFailed
source: Failed to add
es: Error al agregar

source: Removed from vocabulary book
es: Eliminado del vocabulario

# removeFailed
source: Failed to remove
es: Error al eliminar

source: Add to Vocabulary Book
es: Agregar al vocabulario

source: Notes (optional)
es: Notas (opcional)

source: Add
es: Agregar

source: Bookmarked
es: Guardado

source: Bookmark
es: Guardar

source: Remove from vocabulary book
es: Eliminar del vocabulario

source: Similarity: {percent}%
es: Similitud: {percent}%

# addedOrRemoved
source: {added, select, true{Added to vocabulary book} other{Bookmark removed}}
es: {added, select, true{Agregado al vocabulario} other{Marcador eliminado}}

source: days
es: días

# lessonsCompletedCount
source: {count} completed
es: {count} completadas

# dailyGoalComplete
source: Daily goal achieved!
es: ¡Meta diaria cumplida!

# alphabetTable
source: Table
es: Tabla de alfabeto

source: Learn
es: Aprender

source: Practice
es: Practicar

source: Learning Progress
es: Progreso de aprendizaje

# dueForReviewCount
source: {count} due for review
es: {count} para repasar

source: Completion
es: Completado

# totalCharacters
source: Total
es: Total de caracteres

source: Learned
es: Aprendido

source: Due for Review
es: Para repasar

# overallAccuracy
source: Overall accuracy: {percent}%
es: Precisión general: {percent}%

# charactersCount
source: {count} characters
es: {count} caracteres

# lesson1Title
source: Lesson 1: Basic Consonants (1)
es: Lección 1: Consonantes básicas (1)

# lesson1Desc
source: Learn 7 most common consonants
es: Aprende las 7 consonantes más usadas

# lesson2Title
source: Lesson 2: Basic Consonants (2)
es: Lección 2: Consonantes básicas (2)

# lesson2Desc
source: Learn remaining 7 basic consonants
es: Aprende las 7 consonantes restantes

# lesson3Title
source: Lesson 3: Basic Vowels (1)
es: Lección 3: Vocales básicas (1)

# lesson3Desc
source: Learn 5 basic vowels
es: Aprende 5 vocales básicas

# lesson4Title
source: Lesson 4: Basic Vowels (2)
es: Lección 4: Vocales básicas (2)

# lesson4Desc
source: Learn remaining 5 basic vowels
es: Aprende las 5 vocales restantes

# lesson5Title
source: Lesson 5: Double Consonants
es: Lección 5: Consonantes dobles

# lesson5Desc
source: Learn 5 double consonants - tense sounds
es: Aprende 5 consonantes dobles - sonidos fuertes

# lesson6Title
source: Lesson 6: Compound Vowels (1)
es: Lección 6: Vocales compuestas (1)

# lesson6Desc
source: Learn 6 compound vowels
es: Aprende 6 vocales compuestas

# lesson7Title
source: Lesson 7: Compound Vowels (2)
es: Lección 7: Vocales compuestas (2)

# lesson7Desc
source: Learn remaining compound vowels
es: Aprende las vocales compuestas restantes

# loadAlphabetFirst
source: Please load alphabet data first
es: Primero carga los datos del alfabeto

# noContentForLesson
source: No content for this lesson
es: No hay contenido para esta lección

source: Example Words
es: Palabras de ejemplo

# thisLessonCharacters
source: Characters in this lesson
es: Caracteres de esta lección

# congratsLessonComplete
source: Congratulations on completing {title}!
es: ¡Completaste {title}!

source: Continue Practice
es: Continuar practicando

source: Next Lesson
es: Siguiente lección

source: Basic Consonants
es: Consonantes básicas

source: Double Consonants
es: Consonantes dobles

source: Basic Vowels
es: Vocales básicas

source: Compound Vowels
es: Vocales compuestas

# dailyLearningReminderTitle
source: Daily Learning Reminder
es: Recordatorio diario

# dailyLearningReminderBody
source: Time to complete today's Korean study~
es: ¡Completa tu estudio de coreano de hoy~

# reviewReminderTitle
source: Time to Review!
es: ¡Hora de repasar!

# reviewReminderBody
source: Time to review "{title}"~
es: Es hora de repasar「{title}」~

source: Stroke Order
es: Orden de trazos

source: Reset
es: Reiniciar

source: Pronunciation Guide
es: Guía de pronunciación

source: Play
es: Reproducir

source: Pause
es: Pausar

# loadingFailed
source: Loading failed: {error}
es: Error al cargar: {error}

source: Learned: {count}
es: Aprendidos: {count}

source: Hangul Practice
es: Práctica de Hangul

# charactersNeedReview
source: {count} characters need review
es: {count} caracteres necesitan repaso

# charactersAvailable
source: {count} characters available
es: {count} caracteres disponibles

source: Select Practice Mode
es: Seleccionar modo de práctica

source: Character Recognition
es: Reconocimiento de caracteres

# characterRecognitionDesc
source: See the character, choose the correct pronunciation
es: Ve el carácter, elige la pronunciación correcta

source: Pronunciation Practice
es: Práctica de pronunciación

# pronunciationPracticeDesc
source: See the pronunciation, choose the correct character
es: Ve la pronunciación, elige el carácter correcto

source: Start Practice
es: Iniciar práctica

# learnSomeCharactersFirst
source: Please learn some characters in the alphabet first
es: Por favor, aprende algunos caracteres en el alfabeto primero

source: Practice Complete!
es: ¡Práctica completada!

source: Back
es: Volver

source: Try Again
es: Intentar de nuevo

# howToReadThis
source: How do you read this character?
es: ¿Cómo se lee este carácter?

# selectCorrectCharacter
source: Select the correct character
es: Selecciona el carácter correcto

# correctExclamation
source: Correct!
es: ¡Correcto!

# incorrectExclamation
source: Incorrect
es: Incorrecto

# correctAnswerLabel
source: Correct answer:
es: Respuesta correcta:

# nextQuestionBtn
source: Next Question
es: Siguiente pregunta

source: View Results
es: Ver resultados

source: Share
es: Compartir

# mnemonics
source: Memory Tips
es: Trucos de memoria

# nextReviewLabel
source: Next review: {date}
es: Próximo repaso: {date}

source: Expired
es: Vencido

# practiceFunctionDeveloping
source: Practice function under development
es: Función de práctica en desarrollo

source: Romanization:
es: Romanización:

# pronunciationLabel
source: Pronunciation:
es: Pronunciación:

source: Play pronunciation
es: Reproducir pronunciación

# strokesCount
source: {count} strokes
es: {count} trazos

# perfectCount
source: Perfect
es: Perfecto

source: Load failed
es: Error al cargar

# lesson1TitleKo
source: Lesson 1: Basic Consonants (1)
es: Lección 1: Consonantes básicas (1)

# lesson2TitleKo
source: Lesson 2: Basic Consonants (2)
es: Lección 2: Consonantes básicas (2)

# lesson3TitleKo
source: Lesson 3: Basic Vowels (1)
es: Lección 3: Vocales básicas (1)

# lesson4TitleKo
source: Lesson 4: Basic Vowels (2)
es: Lección 4: Vocales básicas (2)

# lesson5TitleKo
source: Lesson 5: Double Consonants
es: Lección 5: Consonantes dobles

# lesson6TitleKo
source: Lesson 6: Compound Vowels (1)
es: Lección 6: Vocales compuestas (1)

# lesson7TitleKo
source: Lesson 7: Compound Vowels (2)
es: Lección 7: Vocales compuestas (2)

source: Exit Lesson
es: Salir de la lección

# exitLessonConfirm
source: Are you sure you want to exit? Your progress will be saved.
es: ¿Seguro que quieres salir? Tu progreso se guardará.

# exitBtn
source: Exit
es: Salir

# loadingLesson
source: Loading {title}...
es: Cargando {title}...

# cannotLoadContent
source: Cannot load lesson content
es: No se puede cargar el contenido de la lección

# noLessonContent
source: No content available for this lesson
es: No hay contenido disponible para esta lección

# stageProgress
source: Stage {current} / {total}
es: Etapa {current} / {total}

# unknownStageType
source: Unknown stage type: {type}
es: Tipo de etapa desconocido: {type}

# wordsCount
source: {count} words
es: {count} palabras

source: Start Learning
es: Comenzar a aprender

source: Vocabulary Learning
es: Aprendizaje de vocabulario

source: No image
es: Sin imagen

# previousItem
source: Previous
es: Anterior

# nextItem
source: Next
es: Siguiente

# playingAudio
source: Playing...
es: Reproduciendo...

source: Play All
es: Reproducir todo

# audioPlayFailed
source: Audio playback failed: {error}
es: Error de reproducción de audio: {error}

# stopBtn
source: Stop
es: Detener

# playAudioBtn
source: Play Audio
es: Reproducir audio

# playingAudioShort
source: Playing audio...
es: Reproduciendo audio...

source: Grammar · {pattern}
es: Gramática · {pattern}

source: Conjugation Rule
es: Regla de conjugación

source: Comparison with Chinese
es: Comparación con el chino

# dialogueTitle
source: Dialogue Practice
es: Práctica de diálogo

# dialogueExplanation
source: Dialogue Analysis
es: Análisis del diálogo

# speaker
source: Speaker {name}
es: Hablante {name}

# practiceTitle
source: Practice
es: Práctica

# practiceInstructions
source: Complete the following exercises
es: Completa los siguientes ejercicios

# checkAnswerBtn
source: Check Answer
es: Verificar respuesta

# quizTitle
source: Quiz
es: Examen

source: Quiz Result
es: Resultado del examen

# quizAccuracy
source: Accuracy: {percent}%
es: Precisión: {percent}%

# summaryTitle
source: Lesson Summary
es: Resumen de la lección

# vocabLearned
source: Vocabulary Learned
es: Vocabulario aprendido

source: Grammar Learned
es: Gramática aprendida

source: Finish Lesson
es: Terminar lección

# reviewVocab
source: Review Vocabulary
es: Revisar vocabulario

# similarity
source: Similarity: {percent}%
es: Similitud: {percent}%

# partOfSpeechNoun
source: Noun
es: Sustantivo

# partOfSpeechVerb
source: Verb
es: Verbo

# partOfSpeechAdjective
source: Adjective
es: Adjetivo

# partOfSpeechAdverb
source: Adverb
es: Adverbio

# partOfSpeechPronoun
source: Pronoun
es: Pronombre

# partOfSpeechParticle
source: Particle
es: Partícula

# partOfSpeechConjunction
source: Conjunction
es: Conjunción

# partOfSpeechInterjection
source: Interjection
es: Interjección

# noVocabulary
source: No vocabulary data
es: Sin datos de vocabulario

# noGrammar
source: No grammar data
es: Sin datos de gramática

# noPractice
source: No practice questions
es: Sin ejercicios de práctica

# noDialogue
source: No dialogue content
es: Sin contenido de diálogo

# noQuiz
source: No quiz questions
es: Sin preguntas de examen

source: Tap to flip
es: Toca para voltear

# listeningQuestion
source: Listening
es: Escucha

source: Submit
es: Enviar

# timeStudied
source: Studied {time}
es: Tiempo estudiado {time}

# statusNotStarted
source: Not Started
es: No iniciado

# statusInProgress
source: In Progress
es: En progreso

# statusCompleted
source: Completed
es: Completado

# statusFailed
source: Failed
es: No aprobado

# masteryNew
source: New
es: Nuevo

# masteryLearning
source: Learning
es: Aprendiendo

# masteryMastered
source: Mastered
es: Dominado

# masteryExpert
source: Expert
es: Experto

# masteryPerfect
source: Perfect
es: Perfecto

# masteryUnknown
source: Unknown
es: Desconocido

# dueForReviewNow
source: Due for review
es: Revisar ahora

# similarityHigh
source: High similarity
es: Alta similitud

# similarityMedium
source: Medium similarity
es: Similitud media

# similarityLow
source: Low similarity
es: Baja similitud

# typeBasicConsonant
source: Basic Consonant
es: Consonante básica

# typeDoubleConsonant
source: Double Consonant
es: Consonante doble

# typeBasicVowel
source: Basic Vowel
es: Vocal básica

# typeCompoundVowel
source: Compound Vowel
es: Vocal compuesta

# typeFinalConsonant
source: Final Consonant
es: Consonante final

# dailyReminderChannel
source: Daily Study Reminder
es: Recordatorio diario de estudio

# dailyReminderChannelDesc
source: Reminds you to study Korean at a set time daily
es: Te recuerda estudiar coreano a una hora fija cada día

# reviewReminderChannel
source: Review Reminder
es: Recordatorio de repaso

# reviewReminderChannelDesc
source: Spaced repetition based review reminders
es: Recordatorios de repaso basados en repetición espaciada

# notificationStudyTime
source: Time to study!
es: ¡Hora de estudiar!
